In [18]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

import json

import pymysql
pymysql.install_as_MySQLdb()

In [19]:
call_file = "../input/311_call_center (1).csv"
call_center_df = pd.read_csv(call_file, dtype={"Zip Code":str}, keep_default_na=False)

call_center_df.head()

#Edit Out Date, Dept Abbreviation, Call Resolution
#Keep Time, Dept Name, Service Name, Zip Code

,Date,Time,Department Abbreviation,Department Name,Service Name,Call Resolution,Zip Code
0,2014-01-01T00:00:00,8:08:54,DOT,Department of Transportation,Parking Enforcement,Transfer (City),91605
1,2014-01-01T00:00:00,8:09:00,LAPD,Los Angeles Police Department,Police Stations (Front Desk / Public Counter -...,Gave Caller Information,90402
2,2014-01-01T00:00:00,8:09:34,DOT,Department of Transportation,Meter Request Service,Gave Caller Information,99999
3,2014-01-01T00:00:00,8:10:11,BOS,PW/Bureau of Sanitation,Replacement/Repair of Curbside Trash Containers,Gave Caller Information,90023
4,2014-01-01T00:00:00,8:11:01,BOS,PW/Bureau of Sanitation,Bulky Item Pick-up,Service Request Processed,90044

In [20]:
# drop NAN
call_center_df = call_center_df.dropna(how='any')
call_center_df.head()

,Date,Time,Department Abbreviation,Department Name,Service Name,Call Resolution,Zip Code
0,2014-01-01T00:00:00,8:08:54,DOT,Department of Transportation,Parking Enforcement,Transfer (City),91605
1,2014-01-01T00:00:00,8:09:00,LAPD,Los Angeles Police Department,Police Stations (Front Desk / Public Counter -...,Gave Caller Information,90402
2,2014-01-01T00:00:00,8:09:34,DOT,Department of Transportation,Meter Request Service,Gave Caller Information,99999
3,2014-01-01T00:00:00,8:10:11,BOS,PW/Bureau of Sanitation,Replacement/Repair of Curbside Trash Containers,Gave Caller Information,90023
4,2014-01-01T00:00:00,8:11:01,BOS,PW/Bureau of Sanitation,Bulky Item Pick-up,Service Request Processed,90044

In [21]:
data = json.load(open('../input/rows.json'))

census_df = pd.DataFrame(data["data"])

In [22]:
census_df.head()

#Drop Columns 0-7
#Keep Columns 8-14 and rename

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,228,A47815EC-0DA0-499D-9CE6-616A23C4F155,228,1457290076,944059,1457290076,944059,None,91371,1,73.5,0,1,1,1.00
1,1,1AE8EAF5-D6E6-4AF9-88FD-3CF179F2A8FC,1,1457290075,944059,1457290075,944059,None,90001,57110,26.6,28468,28642,12971,4.40
2,2,D2556F56-7FB5-4A23-8F98-358D907E9647,2,1457290075,944059,1457290075,944059,None,90002,51223,25.5,24876,26347,11731,4.36
3,3,5586CDA7-6181-489C-999C-422C2CE6ADE3,3,1457290075,944059,1457290075,944059,None,90003,66266,26.3,32631,33635,15642,4.22
4,4,D14749EB-BDDA-4F4C-BE52-19572F7477E3,4,1457290075,944059,1457290075,944059,None,90004,62180,34.8,31302,30878,22547,2.73

In [23]:
new_call_center_df = call_center_df[['Time','Department Name', 'Service Name', 'Zip Code' ]].copy()
new_call_center_df.head()

,Time,Department Name,Service Name,Zip Code
0,8:08:54,Department of Transportation,Parking Enforcement,91605
1,8:09:00,Los Angeles Police Department,Police Stations (Front Desk / Public Counter -...,90402
2,8:09:34,Department of Transportation,Meter Request Service,99999
3,8:10:11,PW/Bureau of Sanitation,Replacement/Repair of Curbside Trash Containers,90023
4,8:11:01,PW/Bureau of Sanitation,Bulky Item Pick-up,90044

In [24]:
new_call_center_trunc = new_call_center_df.truncate(before=None, after=500)
new_call_center_trunc.head()

,Time,Department Name,Service Name,Zip Code
0,8:08:54,Department of Transportation,Parking Enforcement,91605
1,8:09:00,Los Angeles Police Department,Police Stations (Front Desk / Public Counter -...,90402
2,8:09:34,Department of Transportation,Meter Request Service,99999
3,8:10:11,PW/Bureau of Sanitation,Replacement/Repair of Curbside Trash Containers,90023
4,8:11:01,PW/Bureau of Sanitation,Bulky Item Pick-up,90044

In [25]:
new_census_df = census_df[[8, 9, 10, 11, 12, 13, 14]].copy()
new_census_df.head()

      8      9     10     11     12     13    14
0  91371      1  73.5      0      1      1  1.00
1  90001  57110  26.6  28468  28642  12971  4.40
2  90002  51223  25.5  24876  26347  11731  4.36
3  90003  66266  26.3  32631  33635  15642  4.22
4  90004  62180  34.8  31302  30878  22547  2.73

In [26]:
new_census_df = new_census_df.rename(columns=\
                                     {8: "Zip_Code",\
                                       9: "Total_Population",\
                                       10: "Median_Age", \
                                       11: "Total_Males",\
                                       12: "Total_Females",\
                                       13: "Total_Household",\
                                       14: "Average_Household_Size"})
new_census_df.head()

,Zip_Code,Total_Population,Median_Age,Total_Males,Total_Females,Total_Household,Average_Household_Size
0,91371,1,73.5,0,1,1,1.00
1,90001,57110,26.6,28468,28642,12971,4.40
2,90002,51223,25.5,24876,26347,11731,4.36
3,90003,66266,26.3,32631,33635,15642,4.22
4,90004,62180,34.8,31302,30878,22547,2.73

In [27]:
new_call_center_trunc = new_call_center_trunc.rename(columns=\
                                       {"Department Name": "Department_Name",\
                                       "Service Name": "Service_Name",\
                                       "Zip Code": "Zip_Code"})
new_call_center_trunc.head()

,Time,Department_Name,Service_Name,Zip_Code
0,8:08:54,Department of Transportation,Parking Enforcement,91605
1,8:09:00,Los Angeles Police Department,Police Stations (Front Desk / Public Counter -...,90402
2,8:09:34,Department of Transportation,Meter Request Service,99999
3,8:10:11,PW/Bureau of Sanitation,Replacement/Repair of Curbside Trash Containers,90023
4,8:11:01,PW/Bureau of Sanitation,Bulky Item Pick-up,90044

In [28]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [29]:

engine = create_engine('postgres://postgres:caddy10@localhost:5432/call_center_db')

In [30]:
engine.table_names()

['census', 'call_center']

In [ ]:
new_census_df.to_sql(name='census', con=engine, if_exists='append', index=False)

In [ ]:
new_call_center_trunc.to_sql(name='call_center', con=engine, if_exists='append', index=False)

In [39]:
pd.read_sql_query('select * from census', con=engine).head()

,zip_code,total_population,median_age,total_males,total_females,total_households,ave_size
0,90001,57110,26.6,28468,28642,12971,4.4
1,90002,51223,25.5,24876,26347,11731,4.36
2,90003,66266,26.3,32631,33635,15642,4.22
3,90004,62180,34.8,31302,30878,22547,2.73
4,90005,37681,33.9,19299,18382,15044,2.5

In [40]:
pd.read_sql_query('select * from call_center', con=engine).head()

,date_,time_,department_abbreviation,department_name,service_name,call_resolution,zip_code
0,2014-01-01T00:00:00,8:08:54,DOT,Department of Transportation,Parking Enforcement,Transfer (City),91605.0
1,2014-01-01T00:00:00,8:09:00,LAPD,Los Angeles Police Department,Police Stations (Front Desk / Public Counter -...,Gave Caller Information,90402.0
2,2014-01-01T00:00:00,8:09:34,DOT,Department of Transportation,Meter Request Service,Gave Caller Information,99999.0
3,2014-01-01T00:00:00,8:10:11,BOS,PW/Bureau of Sanitation,Replacement/Repair of Curbside Trash Containers,Gave Caller Information,90023.0
4,2014-01-01T00:00:00,8:11:01,BOS,PW/Bureau of Sanitation,Bulky Item Pick-up,Service Request Processed,90044.0

In [41]:
query = 'SELECT call_center.Department_Name, call_center.Service_Name, call_center.Zip_Code, census.Median_Age, census.Total_Males, census.Total_Females FROM call_center JOIN census ON call_center.Zip_Code = census.Zip_Code'

In [42]:
df = pd.read_sql(query, con=engine)
df.head()

,department_name,service_name,zip_code,median_age,total_males,total_females
0,Department of Transportation,Parking Enforcement,91605,31.9,28417,27926
1,Los Angeles Police Department,Police Stations (Front Desk / Public Counter -...,90402,47,5809,6441
2,PW/Bureau of Sanitation,Replacement/Repair of Curbside Trash Containers,90023,28.4,23037,22866
3,PW/Bureau of Sanitation,Bulky Item Pick-up,90044,28.6,43128,46651
4,PW/Bureau of Street Services,Maintenance of Public Street Landscape,91605,31.9,28417,27926